app/views/dishes/_form.html.erb

  <div class="field">
    <% for ingredient in Ingredient.all %>
      <div>
        <%= check_box_tag "dish[ingredient_ids][]", ingredient.id, @dish.ingredients.include?(ingredient) %>
---
SELECT "ingredients".* FROM "ingredients"
SELECT  1 AS one FROM "ingredients" INNER JOIN "dishes_ingredients" ON "ingredients"."id" = "dishes_ingredients"."ingredient_id" WHERE "dishes_ingredients"."dish_id" = $1 AND "ingredients"."id" = $2 LIMIT $3  [["dish_id", 9], ["id", 1], ["LIMIT", 1]]