app/views/dishes/show.html.erb

SELECT "ingredients".* FROM "ingredients" INNER JOIN "dishes_ingredients" ON "ingredients"."id" = "dishes_ingredients"."ingredient_id" WHERE "dishes_ingredients"."dish_id" = $1 ORDER BY "ingredients"."description" ASC  [["dish_id", 12]]
---
  <strong>Ingredientes:</strong><br>
  <% @dish.ingredients.order(:description).each do |ingredient| %>