app/views/dishes/show.html.erb

  <strong>Ingredientes:</strong><br>
  <% @dish.ingredients.each do |ingredient| %>
---
SELECT "ingredients".* FROM "ingredients" INNER JOIN "dishes_ingredients" ON "ingredients"."id" = "dishes_ingredients"."ingredient_id" WHERE "dishes_ingredients"."dish_id" = $1  [["dish_id", 7]]