app/controllers/dishes_controller.rb

SELECT "ingredients".* FROM "ingredients"
---
  def new
    @dish = Dish.new
    @ingredient = Ingredient.all