app/controllers/dishes_controller.rb

  def index
    @dishes = Dish.all.order(:description)
---
SELECT "dishes".* FROM "dishes" ORDER BY "dishes"."description" ASC

  def new
    @dish = Dish.new
    @ingredients = Ingredient.all.order(:description)
---
SELECT "ingredients".* FROM "ingredients" ORDER BY "ingredients"."description" ASC

  def edit
    @ingredients = Ingredient.all.order(:description)
---
SELECT "ingredients".* FROM "ingredients" ORDER BY "ingredients"."description" ASC

  def create
    @dish = Dish.new(dish_params)

    respond_to do |format|
      if @dish.save
---
INSERT INTO "dishes" ("description", "price", "preparationtime", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["description", "Teste"], ["price", 0.0], ["preparationtime", "20:54:00"], ["created_at", "2018-04-12 20:54:23.259163"], ["updated_at", "2018-04-12 20:54:23.259163"]]

  def destroy
    @dish.destroy
---
DELETE FROM "dishes" WHERE "dishes"."id" = $1  [["id", 6]]