app/controllers/ingredients_controller.rb

  def index
    @ingredients = Ingredient.all.order(description: :asc)
---
SELECT "ingredients".* FROM "ingredients" ORDER BY "ingredients"."description" ASC

  def create
    @ingredient = Ingredient.new(ingredient_params)

    respond_to do |format|
      if @ingredient.save
---
INSERT INTO "ingredients" ("description", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["description", "Llalala"], ["created_at", "2018-04-12 19:50:23.031218"], ["updated_at", "2018-04-12 19:50:23.031218"]]

  def update
    respond_to do |format|
      if @ingredient.update(ingredient_params)
---
UPDATE "ingredients" SET "description" = $1, "updated_at" = $2 WHERE "ingredients"."id" = $3  [["description", "CebolaTeste"], ["updated_at", "2018-04-24 21:06:54.701367"], ["id", 6]]

  def destroy
    @ingredient.destroy
---
DELETE FROM "ingredients" WHERE "ingredients"."id" = $1  [["id", 2]]